---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyBoolean
source: html/dfc61a82-ccee-2caf-9174-2b8c7c6b07af.htm
---
# AssetPropertyBoolean Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.